JiriS97/BMIC-Projects/test2/Project_Headers/mc9s08lh64.h
/*** NVOPT - Nonvolatile Flash Options Register; 0x0000FFBF ***/
typedef union {
  byte Byte;
  struct {
    byte SEC0        :1;                                       /* Flash Security Bit 0 */
    byte SEC1        :1;                                       /* Flash Security Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Security Enable */
  } Bits;
  struct {
    byte grpSEC  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} NVOPTSTR;
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */
#define _NVOPT (*(const NVOPTSTR * __far)0x0000FFBF)
#define NVOPT                           _NVOPT.Byte
#define NVOPT_SEC0                      _NVOPT.Bits.SEC0
#define NVOPT_SEC1                      _NVOPT.Bits.SEC1
#define NVOPT_FNORED                    _NVOPT.Bits.FNORED
#define NVOPT_KEYEN                     _NVOPT.Bits.KEYEN
#define NVOPT_SEC                       _NVOPT.MergedBits.grpSEC

#define NVOPT_SEC0_MASK                 1U
#define NVOPT_SEC1_MASK                 2U
#define NVOPT_FNORED_MASK               64U
#define NVOPT_KEYEN_MASK                128U
#define NVOPT_SEC_MASK                  3U
#define NVOPT_SEC_BITNUM                0U



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 19.2.2009 17:22:34 */

#define VREFTRM1                         VREF1TRM
#define VREFTRM1_TRM10                   VREF1TRM_TRM0
#define VREFTRM1_TRM11                   VREF1TRM_TRM1
#define VREFTRM1_TRM12                   VREF1TRM_TRM2
#define VREFTRM1_TRM13                   VREF1TRM_TRM3
#define VREFTRM1_TRM14                   VREF1TRM_TRM4
#define VREFTRM1_TRM15                   VREF1TRM_TRM5
#define VREFTRM1_TRM16                   VREF1TRM_TRM6
#define VREFTRM1_TRM17                   VREF1TRM_TRM7
#define VREFTRM1_TRM10_MASK              VREF1TRM_TRM0_MASK
#define VREFTRM1_TRM11_MASK              VREF1TRM_TRM1_MASK
#define VREFTRM1_TRM12_MASK              VREF1TRM_TRM2_MASK
#define VREFTRM1_TRM13_MASK              VREF1TRM_TRM3_MASK
#define VREFTRM1_TRM14_MASK              VREF1TRM_TRM4_MASK
#define VREFTRM1_TRM15_MASK              VREF1TRM_TRM5_MASK
#define VREFTRM1_TRM16_MASK              VREF1TRM_TRM6_MASK
#define VREFTRM1_TRM17_MASK              VREF1TRM_TRM7_MASK
#define VREFSC1                          VREF1SC
#define VREFSC1_MODE10                   VREF1SC_MODE0
#define VREFSC1_MODE11                   This_symb_has_been_depreciated
#define VREFSC1_VREFST1                  VREF1SC_VREFST
#define VREFSC1_VREFEN1                  VREF1SC_VREFEN
#define VREFSC1_MODE1                    VREF1SC_MODE1
#define VREFSC1_MODE10_MASK              VREF1SC_MODE0_MASK
#define VREFSC1_MODE11_MASK              This_symb_has_been_depreciated
#define VREFSC1_VREFST1_MASK             VREF1SC_VREFST_MASK
#define VREFSC1_VREFEN1_MASK             VREF1SC_VREFEN_MASK
#define VREFSC1_MODE1_MASK               VREF1SC_MODE1_MASK
#define VREFSC1_MODE1_BITNUM             VREF1SC_MODE_BITNUM
#define VREFTRM2                         VREF2TRM                      
#define VREFTRM2_TRM20                   VREF2TRM_TRM0                 
#define VREFTRM2_TRM21                   VREF2TRM_TRM1                 
#define VREFTRM2_TRM22                   VREF2TRM_TRM2                 
#define VREFTRM2_TRM23                   VREF2TRM_TRM3                 
#define VREFTRM2_TRM24                   VREF2TRM_TRM4                 
#define VREFTRM2_TRM25                   VREF2TRM_TRM5                 
#define VREFTRM2_TRM26                   VREF2TRM_TRM6                 
#define VREFTRM2_TRM27                   VREF2TRM_TRM7                 
#define VREFTRM2_TRM20_MASK              VREF2TRM_TRM0_MASK            
#define VREFTRM2_TRM21_MASK              VREF2TRM_TRM1_MASK            
#define VREFTRM2_TRM22_MASK              VREF2TRM_TRM2_MASK            
#define VREFTRM2_TRM23_MASK              VREF2TRM_TRM3_MASK            
#define VREFTRM2_TRM24_MASK              VREF2TRM_TRM4_MASK            
#define VREFTRM2_TRM25_MASK              VREF2TRM_TRM5_MASK            
#define VREFTRM2_TRM26_MASK              VREF2TRM_TRM6_MASK            
#define VREFTRM2_TRM27_MASK              VREF2TRM_TRM7_MASK            
#define VREFSC2                          VREF2SC                       
#define VREFSC2_MODE20                   VREF2SC_MODE0                 
#define VREFSC2_MODE21                   This_symb_has_been_depreciated
#define VREFSC2_VREFST2                  VREF2SC_VREFST                
#define VREFSC2_VREFEN2                  VREF2SC_VREFEN                
#define VREFSC2_MODE2                    VREF2SC_MODE1                 
#define VREFSC2_MODE20_MASK              VREF2SC_MODE0_MASK            
#define VREFSC2_MODE21_MASK              This_symb_has_been_depreciated
#define VREFSC2_VREFST2_MASK             VREF2SC_VREFST_MASK           
#define VREFSC2_VREFEN2_MASK             VREF2SC_VREFEN_MASK           
#define VREFSC2_MODE2_MASK               VREF2SC_MODE1_MASK            
#define VREFSC2_MODE2_BITNUM             VREF2SC_MODE_BITNUM
#define _NVVREFTRM1                      _NVVREF1TRM
#define NVVREFTRM1                       NVVREF1TRM
#define NVVREFTRM1_TRM10                 NVVREF1TRM_TRM0
#define NVVREFTRM1_TRM11                 NVVREF1TRM_TRM1
#define NVVREFTRM1_TRM12                 NVVREF1TRM_TRM2
#define NVVREFTRM1_TRM13                 NVVREF1TRM_TRM3
#define NVVREFTRM1_TRM14                 NVVREF1TRM_TRM4
#define NVVREFTRM1_TRM15                 NVVREF1TRM_TRM5
#define NVVREFTRM1_TRM16                 NVVREF1TRM_TRM6
#define NVVREFTRM1_TRM17                 NVVREF1TRM_TRM7
#define NVVREFTRM1_TRM10_MASK            NVVREF1TRM_TRM0_MASK
#define NVVREFTRM1_TRM11_MASK            NVVREF1TRM_TRM1_MASK
#define NVVREFTRM1_TRM12_MASK            NVVREF1TRM_TRM2_MASK
#define NVVREFTRM1_TRM13_MASK            NVVREF1TRM_TRM3_MASK
#define NVVREFTRM1_TRM14_MASK            NVVREF1TRM_TRM4_MASK
#define NVVREFTRM1_TRM15_MASK            NVVREF1TRM_TRM5_MASK
#define NVVREFTRM1_TRM16_MASK            NVVREF1TRM_TRM6_MASK
#define NVVREFTRM1_TRM17_MASK            NVVREF1TRM_TRM7_MASK
#define _NVVREFTRM2                      _NVVREF2TRM         
#define NVVREFTRM2                       NVVREF2TRM          
#define NVVREFTRM2_TRM20                 NVVREF2TRM_TRM0     
#define NVVREFTRM2_TRM21                 NVVREF2TRM_TRM1     
#define NVVREFTRM2_TRM22                 NVVREF2TRM_TRM2     
#define NVVREFTRM2_TRM23                 NVVREF2TRM_TRM3     
#define NVVREFTRM2_TRM24                 NVVREF2TRM_TRM4     
#define NVVREFTRM2_TRM25                 NVVREF2TRM_TRM5     
#define NVVREFTRM2_TRM26                 NVVREF2TRM_TRM6     
#define NVVREFTRM2_TRM27                 NVVREF2TRM_TRM7     
#define NVVREFTRM2_TRM20_MASK            NVVREF2TRM_TRM0_MASK
#define NVVREFTRM2_TRM21_MASK            NVVREF2TRM_TRM1_MASK
#define NVVREFTRM2_TRM22_MASK            NVVREF2TRM_TRM2_MASK
#define NVVREFTRM2_TRM23_MASK            NVVREF2TRM_TRM3_MASK
#define NVVREFTRM2_TRM24_MASK            NVVREF2TRM_TRM4_MASK
#define NVVREFTRM2_TRM25_MASK            NVVREF2TRM_TRM5_MASK
#define NVVREFTRM2_TRM26_MASK            NVVREF2TRM_TRM6_MASK
#define NVVREFTRM2_TRM27_MASK            NVVREF2TRM_TRM7_MASK

/* **** 27.11.2009 11:30:38 */

#define PPAGE_XA16                       This_symb_has_been_depreciated
#define PPAGE_XA16_MASK                  This_symb_has_been_depreciated
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
